rorke-time/sriov_rorke_time/rorke3000-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        12587.90          ---          ---         1.24976         0.28700         6.55900        14.59100       846.81 
Gets       125846.01     34291.05     91554.96         1.23999         0.28700         6.49500        14.52700      5097.47 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     138433.91     34291.05     91554.96         1.24088         0.28700         6.49500        14.52700      5944.27 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.047        0.000
SET       0.095        5.000
SET       0.119       10.000
SET       0.143       15.000
SET       0.159       20.000
SET       0.175       25.000
SET       0.199       30.000
SET       0.215       35.000
SET       0.239       40.000
SET       0.263       45.000
SET       0.287       50.000
SET       0.303       52.500
SET       0.319       55.000
SET       0.335       57.500
SET       0.351       60.000
SET       0.375       62.500
SET       0.399       65.000
SET       0.423       67.500
SET       0.455       70.000
SET       0.495       72.500
SET       0.551       75.000
SET       0.591       76.250
SET       0.655       77.500
SET       0.759       78.750
SET       1.343       80.000
SET       3.215       81.250
SET       3.343       82.500
SET       3.439       83.750
SET       3.535       85.000
SET       3.679       86.250
SET       3.871       87.500
SET       4.063       88.125
SET       5.727       88.750
SET       5.887       89.375
SET       5.951       90.000
SET       5.983       90.625
SET       6.015       91.250
SET       6.015       91.875
SET       6.047       92.500
SET       6.079       93.125
SET       6.079       93.750
SET       6.079       94.062
SET       6.079       94.375
SET       6.111       94.688
SET       6.111       95.000
SET       6.111       95.312
SET       6.143       95.625
SET       6.143       95.938
SET       6.143       96.250
SET       6.175       96.562
SET       6.175       96.875
SET       6.175       97.031
SET       6.207       97.188
SET       6.207       97.344
SET       6.207       97.500
SET       6.207       97.656
SET       6.239       97.812
SET       6.239       97.969
SET       6.271       98.125
SET       6.271       98.281
SET       6.303       98.438
SET       6.335       98.516
SET       6.335       98.594
SET       6.367       98.672
SET       6.399       98.750
SET       6.431       98.828
SET       6.463       98.906
SET       6.527       98.984
SET       6.655       99.062
SET       6.911       99.141
SET       7.615       99.219
SET       8.191       99.258
SET       8.511       99.297
SET       8.959       99.336
SET       9.087       99.375
SET       9.151       99.414
SET       9.215       99.453
SET       9.343       99.492
SET       9.471       99.531
SET       9.535       99.570
SET       9.791       99.609
SET      10.751       99.629
SET      11.391       99.648
SET      11.647       99.668
SET      11.967       99.688
SET      12.031       99.707
SET      12.095       99.727
SET      12.159       99.746
SET      12.159       99.766
SET      12.223       99.785
SET      12.223       99.805
SET      12.287       99.814
SET      12.351       99.824
SET      12.415       99.834
SET      12.479       99.844
SET      12.607       99.854
SET      12.863       99.863
SET      14.015       99.873
SET      14.335       99.883
SET      14.463       99.893
SET      14.655       99.902
SET      14.911       99.907
SET      14.975       99.912
SET      15.039       99.917
SET      15.103       99.922
SET      15.167       99.927
SET      15.231       99.932
SET      15.231       99.937
SET      15.359       99.941
SET      15.615       99.946
SET      15.807       99.951
SET      15.999       99.954
SET      16.639       99.956
SET      17.279       99.958
SET      17.663       99.961
SET      17.919       99.963
SET      18.047       99.966
SET      18.175       99.968
SET      18.175       99.971
SET      18.175       99.973
SET      18.303       99.976
SET      18.303       99.977
SET      18.303       99.978
SET      18.303       99.979
SET      18.303       99.980
SET      18.431       99.982
SET      18.431       99.983
SET      18.559       99.984
SET      18.559       99.985
SET      18.687       99.987
SET      18.687       99.988
SET      18.815       99.988
SET      18.815       99.989
SET      18.943       99.990
SET      19.327       99.990
SET      20.351       99.991
SET      20.479       99.991
SET      20.479       99.992
SET      20.479       99.993
SET      20.607       99.993
SET      20.607       99.994
SET      20.863       99.994
SET      20.863       99.995
SET      20.991       99.995
SET      20.991       99.995
SET      20.991       99.995
SET      20.991       99.996
SET      21.247       99.996
SET      21.247       99.996
SET      21.247       99.997
SET      21.247       99.997
SET      21.375       99.997
SET      21.375       99.997
SET      21.375       99.997
SET      21.375       99.998
SET      21.503       99.998
SET      21.503       99.998
SET      21.631       99.998
SET      21.887       99.998
SET      21.887       99.998
SET      22.143       99.998
SET      22.143       99.999
SET      22.143       99.999
SET      23.423       99.999
SET      23.423       99.999
SET      23.423       99.999
[...]
SET      24.063       99.999
SET      24.063       99.999
SET      24.063       99.999
[...]
SET      24.063      100.000
SET      24.063      100.000
SET      24.063      100.000
[...]
SET      24.575      100.000
SET      24.575      100.000
---
GET       0.039        0.000
GET       0.095        5.000
GET       0.119       10.000
GET       0.143       15.000
GET       0.159       20.000
GET       0.175       25.000
GET       0.191       30.000
GET       0.215       35.000
GET       0.239       40.000
GET       0.255       45.000
GET       0.287       50.000
GET       0.295       52.500
GET       0.311       55.000
GET       0.327       57.500
GET       0.351       60.000
GET       0.367       62.500
GET       0.391       65.000
GET       0.423       67.500
GET       0.455       70.000
GET       0.495       72.500
GET       0.543       75.000
GET       0.583       76.250
GET       0.639       77.500
GET       0.743       78.750
GET       1.167       80.000
GET       3.199       81.250
GET       3.343       82.500
GET       3.439       83.750
GET       3.535       85.000
GET       3.663       86.250
GET       3.855       87.500
GET       4.031       88.125
GET       5.727       88.750
GET       5.887       89.375
GET       5.951       90.000
GET       5.983       90.625
GET       6.015       91.250
GET       6.015       91.875
GET       6.047       92.500
GET       6.047       93.125
GET       6.079       93.750
GET       6.079       94.062
GET       6.079       94.375
GET       6.111       94.688
GET       6.111       95.000
GET       6.111       95.312
GET       6.111       95.625
GET       6.143       95.938
GET       6.143       96.250
GET       6.143       96.562
GET       6.175       96.875
GET       6.175       97.031
GET       6.175       97.188
GET       6.207       97.344
GET       6.207       97.500
GET       6.207       97.656
GET       6.239       97.812
GET       6.239       97.969
GET       6.239       98.125
GET       6.271       98.281
GET       6.303       98.438
GET       6.303       98.516
GET       6.335       98.594
GET       6.335       98.672
GET       6.367       98.750
GET       6.399       98.828
GET       6.431       98.906
GET       6.495       98.984
GET       6.559       99.062
GET       6.719       99.141
GET       7.103       99.219
GET       7.775       99.258
GET       8.255       99.297
GET       8.575       99.336
GET       8.959       99.375
GET       9.087       99.414
GET       9.151       99.453
GET       9.215       99.492
GET       9.343       99.531
GET       9.471       99.570
GET       9.663       99.609
GET       9.791       99.629
GET      10.431       99.648
GET      11.391       99.668
GET      11.711       99.688
GET      12.031       99.707
GET      12.095       99.727
GET      12.095       99.746
GET      12.159       99.766
GET      12.159       99.785
GET      12.223       99.805
GET      12.287       99.814
GET      12.287       99.824
GET      12.351       99.834
GET      12.415       99.844
GET      12.543       99.854
GET      12.671       99.863
GET      12.927       99.873
GET      14.079       99.883
GET      14.399       99.893
GET      14.591       99.902
GET      14.719       99.907
GET      14.975       99.912
GET      15.039       99.917
GET      15.103       99.922
GET      15.167       99.927
GET      15.167       99.932
GET      15.231       99.937
GET      15.359       99.941
GET      15.551       99.946
GET      15.743       99.951
GET      15.935       99.954
GET      16.255       99.956
GET      17.407       99.958
GET      17.791       99.961
GET      18.047       99.963
GET      18.047       99.966
GET      18.175       99.968
GET      18.175       99.971
GET      18.175       99.973
GET      18.303       99.976
GET      18.303       99.977
GET      18.303       99.978
GET      18.303       99.979
GET      18.431       99.980
GET      18.431       99.982
GET      18.431       99.983
GET      18.431       99.984
GET      18.559       99.985
GET      18.687       99.987
GET      18.815       99.988
GET      18.943       99.988
GET      19.071       99.989
GET      20.223       99.990
GET      20.351       99.990
GET      20.479       99.991
GET      20.607       99.991
GET      20.607       99.992
GET      20.863       99.993
GET      20.991       99.993
GET      21.119       99.994
GET      21.119       99.994
GET      21.247       99.995
GET      21.247       99.995
GET      21.375       99.995
GET      21.375       99.995
GET      21.375       99.996
GET      21.631       99.996
GET      21.759       99.996
GET      22.399       99.997
GET      23.807       99.997
GET      23.935       99.997
GET      24.063       99.997
GET      24.063       99.997
GET      24.063       99.998
GET      24.191       99.998
GET      24.191       99.998
GET      24.191       99.998
GET      24.319       99.998
GET      24.319       99.998
GET      24.319       99.998
GET      24.447       99.999
GET      24.447       99.999
GET      24.447       99.999
[...]
GET      24.575       99.999
GET      24.575       99.999
GET      24.575       99.999
[...]
GET      24.703       99.999
GET      24.703       99.999
GET      24.703       99.999
[...]
GET      32.511      100.000
GET      32.511      100.000
GET      32.511      100.000
[...]
GET      32.639      100.000
GET      32.639      100.000
---
WAIT      0.000      100.000